
#____________________________________________________________________________________________

films = ['Ходячие мертвецы', 'Красавцы', 'Клан Сопрано', 'Дневники вампира']

for i in films:
    print(i)

#_________________________________________________________________________________________


for i in range(25, 51):
    print(i)

#_________________________________________________________________________________________



films = ['Ходячие мертвецы', 'Красавцы', 'Клан Сопрано', 'Дневники вампира']

for i in films:
    print(f'Элемент "{i}" имеет индекс "{films.index(i)}"')

#________________________________________________________________________________________



while True:
    digit = input('Введите любое число от 1 до 10: ')
    if digit == '7':
        print('Вы угадали число!')
    else:
        print('Вы не угадали число')
    if digit == 'X':
        break

#________________________________________________________________________________________



x = [8, 19, 148, 4]
y = [9, 1, 33, 83]
z = []

index = 0

for i in x:
    a = i * y[index]
    index += 1
    z.append(a)


print(z)

#________________________________________________________________________________________

